Repository: bmbravo/buy_car_rule
Catalog: lib/l10n/app_*.arb
Languages: es

source: New Calculation
es: Nuevo Cálculo

# calculatorScreenTitle
source: Calculator
es: Calculadora

# settingsScreenTitle
source: Settings
es: Ajustes

# resultsScreenTitle
source: Results
es: Resultados

source: English
es: Inglés

source: Spanish
es: Español

source: Developed by
es: Desarrollado por

source: Clear Data
es: Limpiar Datos

# anualIncomeTextField
source: Net Anual Income
es: Ingresos Anuales Netos

# carPriceTextField
source: Car Price
es: Precio del Auto

# downPaymentTextField
source: Down Payment
es: Entrada del Auto

# monthlyPaymentTextField
source: Max Monthly Payment
es: Pago Máximo Mensual

# loanTermTextField
source: Loan Term in Years
es: Plazo del Préstamo en Años

# interestRateTextField
source: Loan Interest Rate
es: Tasa de Interés

# calculateButtonText
source: Calculate
es: Calcular

# amortization_french
source: French
es: Francesa

# amortization_german
source: German
es: Alemana

# anualIncomeResultsText
source: Anual Income
es: Ingresos Anuales

# carPriceResultsText
source: Car Price
es: Precio del Auto

# downPaymentResultsText
source: Down Payment
es: Entrada del auto

# loanAmountResultsText
source: Loan Amount
es: Valor del Préstamo

# maxMonthlyPaymentResultsText
source: Maximum Monthly Payment
es: Pago Máximo Mensual

# monthlyPaymentResultsText
source: Monthly Payment
es: Pago Mensual

# amortizationTypeResultsText
source: Amortization Type
es: Tipo de Amortización

# totalInterestResultsText
source: Total Interest
es: Interés Total

# toalLoanAmountResultsText
source: Total Loan Amount
es: Préstamo Total

# tableMonth
source: Month
es: Més

# tablePayment
source: Payment
es: Pago

# tableInterest
source: Interest
es: Interés

# tablePrincipal
source: Principal
es: Amortización

# tableBalance
source: Balance
es: Saldo

source: Calculator Results
es: Resultados Calculadora

# loanResults
source: Amortization Results
es: Resultado Amortización

source: Go Back
es: Regresar

# budgetGood
source: Congratulations! The monthly payment is within your maximum limit. You can afford to buy this car.
es: ¡Felicidades! El pago mensual está dentro de su límite máximo. Puede permitirse comprar este automóvil.

# budgetBad
source: Unfortunately, the monthly payment exceeds your maximum limit. Buying this car may not be financially feasible.
es: Desafortunadamente, el pago mensual excede su límite máximo. Comprar este automóvil puede no ser financieramente viable.

# budgetAlert
source: Budget Status
es: Alerta Presupuesto

# infoDialogTitle
source: Info
es: Información

source: Invalid Input
es: Información Incorrecta

# enterValidText
source: Please enter a valid
es: Ingrese un valor válido para:

# anualIncomeInfo
source: Please enter your annual income. This helps us determine the maximum car price you can afford based on your financial situation.
es: Por favor, ingrese sus ingresos anuales. Esto nos ayuda a determinar el precio máximo del automóvil que puede permitirse según su situación financiera.

# carPriceInfo
source: Please enter the price of the car you are interested in. This will help us calculate the feasibility of your purchase based on your budget.
es: Por favor, ingrese el precio del automóvil que le interesa. Esto nos ayudará a calcular la viabilidad de su compra en función de su presupuesto.

# downPaymentInfo
source: Please enter the amount you plan to use as a down payment. A higher down payment can reduce your monthly payments and overall interest.
es: Por favor, ingrese la cantidad que planea usar como pago inicial. Un pago inicial más alto puede reducir sus pagos mensuales y los intereses totales.

# maxMonthlyPaymentInfo
source: Please enter the maximum amount you can afford to pay monthly. This helps ensure that your car payments fit within your budget.
es: Por favor, ingrese la cantidad máxima que puede pagar mensualmente. Esto ayuda a asegurar que los pagos del automóvil se ajusten a su presupuesto.

# loanTermInfo
source: Please enter the term of the loan in years. The loan term affects your monthly payment amount and total interest paid.
es: Por favor, ingrese el plazo del préstamo en años. El plazo del préstamo afecta el monto de su pago mensual y los intereses totales pagados.

# interestRateInfo
source: Please enter the interest rate for your car loan. The interest rate impacts your monthly payments and the total cost of the loan.
es: Por favor, ingrese la tasa de interés para su préstamo automotriz. La tasa de interés impacta sus pagos mensuales y el costo total del préstamo.

# languageSettings
source: Language
es: Idioma
